using System;

namespace Grayscale.Kifuwarane.Entities.ApplicatedGame
{
    /// <summary>
    /// 先後です。
    /// 
    /// ・先手
    /// ・後手
    /// ・どちらも持っていない
    /// 
    /// の３つです。
    /// 
    /// これをビットフィールドで表現します。
    /// 
    /// [0]００００　どちらも持っていない
    /// [1]０００１　先手
    /// [3]００１０　後手
    /// 
    /// </summary>
    [Flags]// Enum型をビット・フィールド化
    public enum Sengo
    {

        /// <summary>
        /// ------------------------------------------------------------------------------------------------------------------------
        /// なんの働きもしない値(*1)として。
        /// ------------------------------------------------------------------------------------------------------------------------
        /// </summary>
        Empty=0,

        /// <summary>
        /// 先手
        /// </summary>
        Sente=1,

        /// <summary>
        /// 後手
        /// </summary>
        Gote=3,
    }
}
